// SOLID principles

/* 
    1. Single Responsibility principle (SRP)
        Принцип Единственной Отвественности:
    У Класса должна быть только одна причина для изменения

    2. Open-closed principle (OCP)
        Принцип Открытости/Закрытости:
    - Программные сущности должны быть открыты для расширения 
    и закрыты для изменения

    3. Liskov Substitution principle (LSP)
        Принцип подстоновки Лисков:
     - Функционал который использует базовый тип, должны уметь 
    использовать и дочерные типы.

    4. Interface Segragation principle (ISP)
        Принцип разделения интерфейса:
    - Много интерфейсов специального назначения, 
    лучше чем один интерфейс общего назначения

    5. Dependency Inversion principle (DIP)
        Принцип инверсии зависимостей
    - Зависимость на абстракциях. 
    Нет зависемости на что-то конкретное.
    

*/